# part A

# q1

In [124]:
# 1.Find those groups which have more “True” values than
# “False” values in the below dataframe:

# df = pd.DataFrame({'A': ['group1', 'group1', 'group2', 'group1','group2',
# 'group1', 'group2', 'group2','group2','group1'],
# 'B': ['true', 'true', 'true', 'false', 'false', 'false', 'false', 'true','false','true']})

In [159]:
import pandas as pd
import numpy as np

In [160]:
df = pd.DataFrame({'A': ['group1', 'group1', 'group2', 'group1','group2',
'group1', 'group2', 'group2','group2','group1'],
'B': ['true', 'true', 'true', 'false', 'false', 'false', 'false', 'true','false','true']})

In [161]:
df

        A      B
0  group1   true
1  group1   true
2  group2   true
3  group1  false
4  group2  false
5  group1  false
6  group2  false
7  group2   true
8  group2  false
9  group1   true

In [162]:
df[(df['B']=='true') & (df['A']=='group1')]

        A     B
0  group1  true
1  group1  true
9  group1  true

In [163]:
df.loc[(df['B']=='true') & (df['A']=='group2')]

        A     B
2  group2  true
7  group2  true

In [166]:
df1 = df.groupby('A').apply(lambda x:x['B'].value_counts().index[0]) 
df1 = df1.reset_index()
df1['A'][0]

'group1'

In [30]:
# hence we can see that we have 3 number of true in grp 1 and 2 number of true in grp2

# q2

In [35]:
#  2.
# a.   Get the items not common to both series A and series B (Without
#      using loops)
# b)   Get the items common to both series A and series B(Without using
#      loops)
#      input
#       ser1 = pd.Series([1, 2, 3, 4, 5])
#       ser2 = pd.Series([4, 5, 6, 7, 8])

In [36]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [44]:
union = pd.Series(np.union1d(ser1, ser2))

In [45]:
intersect = pd.Series(np.intersect1d(ser1, ser2))

In [48]:
notcommonseries = union[~union.isin(intersect)]
notcommonseries  ### unique to each series

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

In [52]:
intersect  ### commmon to both series

0    4
1    5
dtype: int64

# q3

In [53]:
# 3.a.Generate a random series of length 10 and find the positions of
# numbers that are multiples of 3 from a series?
# b.Compute the cumulative difference between the consecutive
# number for the same series(without using loops).
# # input
# Series ==>[1, 3, 6, 10, 15, 21, 27, 35]
# # Desired Output
# # [nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]

In [54]:
num = pd.Series(np.random.randint(1,50,10))

In [76]:
result = [num%3==0]
result

[0     True
 1     True
 2    False
 3    False
 4    False
 5    False
 6     True
 7    False
 8    False
 9    False
 dtype: bool]

In [58]:
num

0    15
1    12
2    28
3     7
4     2
5    37
6     9
7    34
8    29
9    29
dtype: int32

In [131]:
num[num%3==0]

0    15
1    12
6     9
dtype: int32

In [134]:
# b.Compute the cumulative difference between the consecutive
# number for the same series(without using loops).

import operator
res = list(map(operator.sub,num[1:],num[:-1]))
res

[-3, 16, -21, -5, 35, -28, 25, -5, 0]

# PART B

# q1

In [136]:
# 1. Find the Average price of project from each state

In [137]:
df = pd.read_csv('Grouby_Assignment_Data.csv')

In [138]:
df.head(4)

,Unnamed: 0,Unnamed: 0.1,school_state,teacher_prefix,project_grade_category,teacher_number_of_previously_posted_projects,project_is_approved,project_subject_categories,project_subject_subcategories,price,quantity
0,0,0,in,mrs,grades_prek_2,0,0,literacy_language,esl_literacy,154.60,23
1,1,1,fl,mr,grades_6_8,7,1,history_civics_health_sports,civics_government_teamsports,299.00,1
2,2,2,az,ms,grades_6_8,1,0,health_sports,health_wellness_teamsports,516.85,22
3,3,3,ky,mrs,grades_prek_2,4,1,literacy_language_math_science,literacy_mathematics,232.90,4

In [139]:
df.groupby('school_state').mean()['price']

school_state
ak    337.510667
al    298.641397
ar    278.166613
az    252.355673
ca    323.282639
co    252.666940
ct    311.030415
dc    360.152267
de    234.136735
fl    297.499525
ga    308.207945
hi    365.838639
ia    284.773153
id    253.708874
il    284.538685
in    249.736221
ks    246.894763
ky    280.020031
la    358.954185
ma    328.623520
md    303.952794
me    274.640000
mi    299.793970
mn    249.289851
mo    276.094635
ms    306.512922
mt    278.000490
nc    254.037568
nd    256.985035
ne    286.515307
nh    330.994425
nj    336.891618
nm    297.836876
nv    283.005000
ny    335.973861
oh    271.301090
ok    264.163071
or    289.779098
pa    279.585613
ri    296.904035
sc    247.343586
sd    249.673433
tn    279.079419
tx    304.977799
ut    310.182139
va    267.539311
vt    289.467250
wa    283.266018
wi    301.433963
wv    258.633121
wy    307.638878
Name: price, dtype: float64

## q2

In [140]:
# 2.
# a. Find the total number of projects previously posted by all the
# teachers belonging to each teacher prefix.
# For Example all the teachers having prefix as dr have posted a total of
# 13 projects combined previously.

In [141]:
df.head(3)

,Unnamed: 0,Unnamed: 0.1,school_state,teacher_prefix,project_grade_category,teacher_number_of_previously_posted_projects,project_is_approved,project_subject_categories,project_subject_subcategories,price,quantity
0,0,0,in,mrs,grades_prek_2,0,0,literacy_language,esl_literacy,154.60,23
1,1,1,fl,mr,grades_6_8,7,1,history_civics_health_sports,civics_government_teamsports,299.00,1
2,2,2,az,ms,grades_6_8,1,0,health_sports,health_wellness_teamsports,516.85,22

In [142]:
df.groupby('teacher_prefix').sum()['teacher_number_of_previously_posted_projects']

teacher_prefix
dr             53
mr         129516
mrs        639471
ms         441295
teacher      7671
Name: teacher_number_of_previously_posted_projects, dtype: int64

In [143]:
# b. Find the prefix of the teacher who has posted the maximum of
# projects previously

In [144]:
df['teacher_prefix'][df['teacher_number_of_previously_posted_projects'].max()]

'mrs'

In [145]:
df['teacher_number_of_previously_posted_projects'].max()

451

# q3

In [146]:
# 3. Find the number of projects approved for each project subject
# category belonging to the project grade category 'grade_9_12'

In [147]:
df[df['project_grade_category']=='grade_9_12']['project_is_approved'].sum()

0

In [208]:
x = df[df.project_grade_category == 'grades_9_12'].groupby('project_subject_categories')['project_is_approved'].count()
print("number of projects approved for each project subject category belonging to the project grade category 'grade_9_12' : ")
print(x)

number of projects approved for each project subject category belonging to the project grade category 'grade_9_12' :
project_subject_categories
appliedlearning                        494
appliedlearning_health_sports           43
appliedlearning_history_civics          72
appliedlearning_literacy_language      219
appliedlearning_math_science           171
appliedlearning_music_arts             175
appliedlearning_specialneeds           124
appliedlearning_warmth_care_hunger       1
health_sports                         1137
health_sports_appliedlearning            7
health_sports_history_civics             9
health_sports_literacy_language         12
health_sports_math_science              10
health_sports_music_arts                22
health_sports_specialneeds              67
health_sports_warmth_care_hunger         2
history_civics                         531
history_civics_appliedlearning          11
history_civics_health_sports             6
history_civics_literacy_language       104
history_civics_math_science             20
history_civics_music_arts               60
history_civics_specialneeds             65
literacy_language                     2030
literacy_language_appliedlearning       26
literacy_language_health_sports          9
literacy_language_history_civics        61
literacy_language_math_science          85
literacy_language_music_arts           189
literacy_language_specialneeds         256
math_science                          2408
math_science_appliedlearning           174
math_science_health_sports              62
math_science_history_civics             39
math_science_literacy_language          76
math_science_music_arts                176
math_science_specialneeds              208
math_science_warmth_care_hunger          2
music_arts                            1125
music_arts_appliedlearning               1
music_arts_health_sports                 6
music_arts_history_civics                1
music_arts_specialneeds                 19
specialneeds                           390
specialneeds_health_sports              18
specialneeds_music_arts                 49
specialneeds_warmth_care_hunger          5
warmth_care_hunger                     183
Name: project_is_approved, dtype: int64

# q4

In [148]:
# 4.Replace teacher_prefix with the average number of approved
# projects for each teacher prefix

In [172]:
df.head(3)

        A     B
0  group1  true
1  group1  true
2  group2  true

In [206]:
df.groupby('project_is_approved').count()

,Unnamed: 0,Unnamed: 0.1,school_state,teacher_prefix,project_grade_category,teacher_number_of_previously_posted_projects,project_subject_categories,project_subject_subcategories,price,quantity
project_is_approved,,,,,,,,,,
0,16540,16540,16540,16540,16540,16540,16540,16540,16540,16540
1,92686,92686,92686,92686,92686,92686,92686,92686,92686,92686

In [205]:
df.groupby('teacher_prefix').mean()['project_is_approved']

teacher_prefix
0.692308    0.692308
0.795339    0.795339
0.841522    0.841522
0.843519    0.843519
0.855546    0.855546
Name: project_is_approved, dtype: float64

# q5

In [151]:
# 5.Find the desired output as shown in the image below.

In [152]:
df1 = df[['school_state','project_is_approved']]

In [153]:
df1.head(5)

  school_state  project_is_approved
0           in                    0
1           fl                    1
2           az                    0
3           ky                    1
4           tx                    1

In [154]:
df1[df1['school_state']=='in']

       school_state  project_is_approved
0                in                    0
30               in                    1
155              in                    1
171              in                    1
189              in                    1
...             ...                  ...
109101           in                    1
109111           in                    1
109121           in                    1
109140           in                    1
109215           in                    1

[2620 rows x 2 columns]

In [155]:
df1[df1['school_state']=='in'].groupby('project_is_approved').count()

                     school_state
project_is_approved
0                             406
1                            2214

In [167]:
train_data = pd.DataFrame({"state":["A", "B", "C", "A", "A", "B", "A", "A", "C", "C"], "class":[0, 1, 1, 0, 1, 1, 0, 1, 1, 0]})
train_data

print(train_data)
train_data.state = train_data["state"].map({"A":3, "B":0, "C":1})
n = 2
encoded_train_data = pd.DataFrame()
encoded_train_data["state_0"] = train_data.state.div(train_data.state + 2)
encoded_train_data["state_1"] = 2 / (train_data.state + 2)
encoded_train_data

  state  class
0     A      0
1     B      1
2     C      1
3     A      0
4     A      1
5     B      1
6     A      0
7     A      1
8     C      1
9     C      0

    state_0   state_1
0  0.600000  0.400000
1  0.000000  1.000000
2  0.333333  0.666667
3  0.600000  0.400000
4  0.600000  0.400000
5  0.000000  1.000000
6  0.600000  0.400000
7  0.600000  0.400000
8  0.333333  0.666667
9  0.333333  0.666667

In [168]:
Train = pd.DataFrame({'State':['A','B', 'C', 'A', 'A', 'B', 'A', 'A','C','C'],'class':[0,1,1,0,1,1,0,1,1,0]}) #Make Dataframe
gbtr = Train.groupby('class') #Group by class
g0 = gbtr.get_group(0) #Seperate the two groups
g1 = gbtr.get_group(1)
count0 = g0['State'].value_counts() #value count for both groups 
count1 = g1['State'].value_counts()
final0 = count0.divide(count1.add(count0, fill_value=0),fill_value=0) #Finol value series to merge
final1 = count1.divide(count1.add(count0, fill_value=0),fill_value=0)
dff0 = pd.DataFrame({'State':list(final0.index),'State_0':list(final0)}) #Convert to suitable dataframes
dff1 = pd.DataFrame({'State':list(final1.index),'State_1':list(final1)})
print(Train.merge(dff0,left_on='State',right_on='State').merge(dff1,left_on='State',right_on='State')) #merge Statement

  State  class   State_0   State_1
0     A      0  0.600000  0.400000
1     A      0  0.600000  0.400000
2     A      1  0.600000  0.400000
3     A      0  0.600000  0.400000
4     A      1  0.600000  0.400000
5     B      1  0.000000  1.000000
6     B      1  0.000000  1.000000
7     C      1  0.333333  0.666667
8     C      1  0.333333  0.666667
9     C      0  0.333333  0.666667